** Scripts                                                         :noexport:

#+name: instantiate-template
#+begin_src shell :var in="" tangle="/tmp/test" lang="c++" :results verbatim drawer
echo "#+begin_src $lang :tangle $tangle"
./tools/field-instantiate.sh templates/$in
echo "#+end_src"
#+end_src

#+RESULTS: instantiate-template
:results:
#+begin_src c++ :tangle /tmp/test
#+end_src
:end:


#+name: instantiate-header
#+begin_src shell :var in="" tangle="/tmp/test" lang="c++" :results verbatim drawer
echo "#+begin_src $lang :tangle $tangle"
tmp=$(mktemp)
cp templates/${in} "${tmp}"
sed -i "s/)[ ]*$/);/g" ${tmp}
./tools/field-instantiate.sh ${tmp}
echo "#+end_src"
#+end_src

#+RESULTS: instantiate-header
:results:
#+begin_src c++ :tangle /tmp/test
#+end_src
:end:


